<template>
  <div :class="$style.root">
    <div :class="$style.logo">
      <a href="https://lk.otlnal.ru/login/">
        <img src="/logo-gray.svg" alt="Отличные Наличные" />
      </a>
    </div>
    <div :class="$style.info">
      <div :class="$style.info_one">
        <h3 :class="$style.header">ООО МКК "Финансовый супермаркет"</h3>
        <div :class="$style.links">
          <a href="https://twitter.com/otlnal" target="_blank">
            <svg width="50" height="50" viewBox="0 0 50 50" fill="none" xmlns="http://www.w3.org/2000/svg">
              <circle cx="25" cy="25" r="24" stroke="#FFFFFF" stroke-width="2"></circle>
              <path
                d="M38.25 18.625C37.375 19 36.375 19.25 35.375 19.375C36.375 18.75 37.25 17.75 37.625 16.625C36.625 17.25 35.625 17.625 34.375 17.875C33.5 16.875 32.125 16.25 30.75 16.25C28 16.25 25.75 18.5 25.75 21.25C25.75 21.625 25.75 22 25.875 22.375C21.75 22.125 18 20.125 15.5 17.125C15.125 17.875 14.875 18.75 14.875 19.625C14.875 21.375 15.75 22.875 17.125 23.75C16.25 23.75 15.5 23.5 14.875 23.125C14.875 25.5 16.625 27.625 18.875 28C18.5 28.125 18 28.125 17.5 28.125C17.125 28.125 16.875 28.125 16.5 28C17.125 30 19 31.5 21.25 31.5C19.5 32.875 17.375 33.625 15 33.625C14.625 33.625 14.25 33.625 13.75 33.5C16 34.875 18.625 35.75 21.5 35.75C30.75 35.75 35.75 28.125 35.75 21.5V20.875C36.75 20.5 37.625 19.625 38.25 18.625Z"
                fill="#FFFFFF"
              ></path></svg
          ></a>
          <a href="https://vk.com/otlnal_ru" target="_blank">
            <svg width="50" height="50" viewBox="0 0 50 50" fill="none" xmlns="http://www.w3.org/2000/svg">
              <circle cx="25" cy="25" r="24" stroke="#FFFFFF" stroke-width="2"></circle>
              <path
                d="M37.2576 31.3941C37.2576 31.2903 37.1539 31.2903 37.1539 31.1865C36.7387 30.3563 35.8047 29.3185 34.5594 28.1769C33.9367 27.658 33.6254 27.2429 33.4178 27.0354C33.1065 26.6203 33.1065 26.3089 33.2103 25.8938C33.3141 25.5825 33.7292 25.0636 34.4556 24.1296C34.8707 23.6107 35.0783 23.2993 35.3896 22.988C36.9463 20.9124 37.6727 19.5633 37.4652 18.9406L37.3614 18.8369C37.2577 18.7331 37.1538 18.6293 36.9463 18.6293C36.7387 18.5255 36.4274 18.5255 36.1161 18.6293H32.1725C32.0687 18.6293 32.0687 18.6293 31.8611 18.6293C31.7574 18.6293 31.6536 18.6293 31.6536 18.6293H31.5498H31.446L31.3422 18.7331C31.2385 18.8369 31.2385 18.8368 31.2385 18.9406C30.8233 20.0822 30.3045 21.0162 29.7856 22.054C29.4742 22.5729 29.1629 23.0918 28.8516 23.5069C28.5402 23.922 28.3327 24.2333 28.1251 24.4409C27.9175 24.6485 27.71 24.7522 27.6062 24.9598C27.5024 25.0636 27.2949 25.1674 27.2949 25.0636C27.1911 25.0636 27.0873 25.0636 27.0873 24.9598C26.9835 24.856 26.8798 24.7522 26.776 24.6485C26.6722 24.5447 26.6722 24.3371 26.5684 24.1296C26.5684 23.922 26.5684 23.7144 26.5684 23.6107C26.5684 23.5069 26.5684 23.1956 26.5684 22.988C26.5684 22.6767 26.5684 22.4691 26.5684 22.3653C26.5684 22.054 26.5684 21.6389 26.5684 21.2238C26.5684 20.8087 26.5684 20.4973 26.5684 20.2898C26.5684 20.0822 26.5684 19.7709 26.5684 19.5633C26.5684 19.252 26.5684 19.0444 26.5684 18.9406C26.5684 18.8368 26.4647 18.6293 26.4647 18.5255C26.3609 18.4217 26.2571 18.318 26.1533 18.2142C26.0495 18.1104 25.842 18.1104 25.7382 18.0066C25.2193 17.9028 24.5967 17.7991 23.8702 17.7991C22.2097 17.7991 21.0682 17.9029 20.6531 18.1104C20.4455 18.2142 20.2379 18.318 20.1342 18.5255C19.9266 18.7331 19.9266 18.8369 20.0304 18.8369C20.5493 18.9406 20.9644 19.1482 21.172 19.4595L21.2757 19.6671C21.3795 19.7709 21.3795 19.9784 21.4833 20.2898C21.5871 20.6011 21.5871 20.9124 21.5871 21.3275C21.5871 21.9502 21.5871 22.5729 21.5871 22.988C21.5871 23.5069 21.4833 23.8182 21.4833 24.1296C21.4833 24.4409 21.3795 24.6485 21.2757 24.7522C21.172 24.9598 21.1719 25.0636 21.0682 25.0636C21.0682 25.0636 21.0682 25.1673 20.9644 25.1673C20.8606 25.1673 20.7568 25.2711 20.5493 25.2711C20.4455 25.2711 20.2379 25.1674 20.1342 25.0636C19.9266 24.9598 19.7191 24.7522 19.6153 24.5447C19.4077 24.3371 19.2002 24.0258 18.9926 23.6107C18.785 23.1956 18.4737 22.7804 18.2661 22.1578L18.0586 21.7427C17.9548 21.5351 17.7473 21.12 17.5397 20.6011C17.3321 20.0822 17.1246 19.6671 16.917 19.1482C16.8132 18.9406 16.7095 18.8369 16.6057 18.7331H16.5019C16.5019 18.7331 16.3981 18.6293 16.2943 18.6293C16.1906 18.6293 16.0868 18.5255 15.983 18.5255H12.247C11.8319 18.5255 11.6243 18.6293 11.5205 18.7331L11.4167 18.8369C11.4167 18.8369 11.4167 18.9406 11.4167 19.0444C11.4167 19.1482 11.4168 19.252 11.5205 19.4595C12.0394 20.7049 12.6621 21.9502 13.2848 23.1956C13.9074 24.3371 14.5301 25.3749 14.9452 26.1014C15.4641 26.8278 15.8792 27.5543 16.3981 28.1769C16.917 28.7996 17.2283 29.2147 17.3321 29.4223C17.5397 29.6298 17.6435 29.7336 17.7472 29.8374L18.0586 30.1487C18.2661 30.3563 18.5775 30.6676 18.9926 30.979C19.4077 31.2903 19.9266 31.6016 20.4455 31.913C20.9644 32.2243 21.5871 32.4319 22.2097 32.6394C22.9362 32.847 23.5589 32.9508 24.1815 32.847H25.7382C26.0495 32.847 26.2571 32.7432 26.4647 32.5356L26.5684 32.4319C26.5684 32.3281 26.6722 32.3281 26.6722 32.2243C26.6722 32.1205 26.6722 32.0167 26.6722 31.8092C26.6722 31.3941 26.6722 31.0827 26.776 30.7714C26.8798 30.4601 26.8798 30.2525 26.9836 30.045C27.0873 29.8374 27.1911 29.7336 27.2949 29.6298C27.3987 29.5261 27.5025 29.4223 27.5025 29.4223H27.6062C27.8138 29.3185 28.1251 29.4223 28.3327 29.6298C28.644 29.8374 28.9553 30.1487 29.1629 30.4601C29.3704 30.7714 29.6818 31.0827 30.0969 31.4979C30.512 31.913 30.8234 32.2243 31.0309 32.3281L31.3422 32.5356C31.5498 32.6394 31.7574 32.7432 32.0687 32.847C32.38 32.9508 32.5876 32.9507 32.7951 32.9507L36.3236 32.847C36.635 32.847 36.9463 32.7432 37.1539 32.6394C37.3614 32.5356 37.4652 32.4319 37.4652 32.2243C37.4652 32.1205 37.4652 31.913 37.4652 31.8092C37.2576 31.6016 37.2576 31.4978 37.2576 31.3941Z"
                fill="#FFFFFF"
              ></path></svg
          ></a>
          <a href="https://t.me/otlnal_official" target="_blank">
            <svg width="50" height="50" viewBox="0 0 50 50" fill="none" xmlns="http://www.w3.org/2000/svg">
              <circle cx="25" cy="25" r="24" stroke="#FFFFFF" stroke-width="2"></circle>
              <path
                d="M11.6884 25.4676L17.436 27.6108L19.6766 34.8196C19.774 35.3067 20.3585 35.4041 20.7482 35.1119L23.9629 32.4816C24.2552 32.1894 24.7423 32.1894 25.1319 32.4816L30.8795 36.6705C31.2692 36.9628 31.8537 36.768 31.9511 36.2809L36.2375 15.8233C36.3349 15.3362 35.8478 14.8492 35.3607 15.044L11.6884 24.2012C11.1039 24.396 11.1039 25.2728 11.6884 25.4676ZM19.3843 26.5392L30.6847 19.6226C30.8795 19.5252 31.0744 19.8174 30.8795 19.9148L21.6249 28.5849C21.3327 28.8772 21.0404 29.2669 21.0404 29.7539L20.7482 32.092C20.7482 32.3842 20.2611 32.4816 20.1637 32.092L18.9946 27.8056C18.7024 27.3185 18.8973 26.734 19.3843 26.5392Z"
                fill="#FFFFFF"
              ></path></svg
          ></a>
          <a href="https://m.ok.ru/dk" target="_blank">
            <svg width="50" height="50" viewBox="0 0 50 50" fill="none" xmlns="http://www.w3.org/2000/svg">
              <circle cx="25" cy="25" r="24" stroke="#FFFFFF" stroke-width="2"></circle>
              <path
                d="M32.7971 28.491C33.453 27.8351 33.5467 26.8981 32.9845 25.9611C32.516 25.2115 31.6726 24.8367 30.7356 25.0241C30.3608 25.1178 29.986 25.3052 29.6112 25.5863C26.7065 27.554 22.771 27.4603 19.8663 25.4926C19.6789 25.3989 19.4915 25.3052 19.3041 25.2115C18.2734 24.743 17.2427 24.9304 16.6804 25.8674C16.0245 26.8044 16.1182 27.8351 16.9615 28.6785C17.1489 28.8659 17.3363 28.9596 17.43 29.147L17.5238 29.2407C18.8356 30.2714 20.4285 30.9273 22.4899 31.2084L21.2718 32.4265C20.2411 33.4572 19.1167 34.5816 18.086 35.6123C17.8049 35.8934 17.43 36.3619 17.43 37.0179C17.43 37.8612 17.8986 38.7045 18.7419 39.0793C19.023 39.2667 19.3041 39.2667 19.5852 39.2667C20.0537 39.2667 20.6159 39.0793 20.9907 38.6108C22.3962 37.2053 23.5206 36.0808 24.6451 34.9564C24.7388 34.8627 24.7387 34.8627 24.7387 34.8627C24.7387 34.8627 24.8325 34.8627 24.8325 34.9564C25.5821 35.7997 26.4254 36.5493 27.175 37.3927C27.5498 37.7675 27.9246 38.1423 28.2994 38.5171C28.7679 38.9856 29.1427 39.173 29.7049 39.173C30.5482 39.2667 31.4852 38.7045 31.86 37.8612C32.2348 37.1116 32.0474 36.1745 31.3915 35.6123C30.4545 34.6753 29.5175 33.6446 28.4868 32.7076L26.8939 31.1147C27.7372 31.021 28.6742 30.8336 29.5175 30.4588C30.923 29.9903 31.9537 29.3343 32.7971 28.491Z"
                fill="#FFFFFF"
              ></path>
              <path
                d="M24.7387 25.8674C28.7679 25.8674 32.0474 22.6815 32.0474 18.6524C32.0474 16.6847 31.2978 14.8107 29.8923 13.4051C28.4868 11.9996 26.7065 11.25 24.8324 11.25C20.8033 11.25 17.6175 14.5295 17.5237 18.465C17.5237 20.4327 18.2734 22.213 19.6789 23.6186C20.9907 25.1178 22.771 25.8674 24.7387 25.8674ZM22.6773 16.4973C23.2395 15.9351 23.9891 15.654 24.7387 15.654C26.4254 15.654 27.6435 16.9658 27.6435 18.5587C27.6435 20.2453 26.3317 21.4634 24.7387 21.4634C23.0521 21.4634 21.834 20.1516 21.834 18.5587C21.834 17.8091 22.1151 17.0595 22.6773 16.4973Z"
                fill="#FFFFFF"
              ></path>
              <path
                d="M32.7971 28.491C33.453 27.8351 33.5467 26.8981 32.9845 25.9611C32.516 25.2115 31.6726 24.8367 30.7356 25.0241C30.3608 25.1178 29.986 25.3052 29.6112 25.5863C26.7065 27.554 22.771 27.4603 19.8663 25.4926C19.6789 25.3989 19.4915 25.3052 19.3041 25.2115C18.2734 24.743 17.2427 24.9304 16.6804 25.8674C16.0245 26.8044 16.1182 27.8351 16.9615 28.6785C17.1489 28.8659 17.3363 28.9596 17.43 29.147L17.5238 29.2407C18.8356 30.2714 20.4285 30.9273 22.4899 31.2084L21.2718 32.4265C20.2411 33.4572 19.1167 34.5816 18.086 35.6123C17.8049 35.8934 17.43 36.3619 17.43 37.0179C17.43 37.8612 17.8986 38.7045 18.7419 39.0793C19.023 39.2667 19.3041 39.2667 19.5852 39.2667C20.0537 39.2667 20.6159 39.0793 20.9907 38.6108C22.3962 37.2053 23.5206 36.0808 24.6451 34.9564C24.7388 34.8627 24.7387 34.8627 24.7387 34.8627C24.7387 34.8627 24.8325 34.8627 24.8325 34.9564C25.5821 35.7997 26.4254 36.5493 27.175 37.3927C27.5498 37.7675 27.9246 38.1423 28.2994 38.5171C28.7679 38.9856 29.1427 39.173 29.7049 39.173C30.5482 39.2667 31.4852 38.7045 31.86 37.8612C32.2348 37.1116 32.0474 36.1745 31.3915 35.6123C30.4545 34.6753 29.5175 33.6446 28.4868 32.7076L26.8939 31.1147C27.7372 31.021 28.6742 30.8336 29.5175 30.4588C30.923 29.9903 31.9537 29.3343 32.7971 28.491Z"
                fill="#FFFFFF"
              ></path></svg
          ></a>
        </div>
        <h4 :class="$style.header">{{ new Date().getFullYear() }} ©</h4>
      </div>
      <div :class="$style.info_two">
        <h3 :class="$style.header">Базовые стандарты и иное профзаконодательство</h3>
        <p>
          <a
            :class="$style.link"
            href="https://www.otlnal.ru/upload/iblock/771/771a699b1d1d337eac82757dccd8beef.pdf"
            target="_blank"
            rel="noreferrer noopener"
            >Базовый стандарт защиты прав и интересов получателей фин. услуг</a
          >
        </p>
        <p>
          <a
            :class="$style.link"
            href="https://www.otlnal.ru/upload/iblock/ddd/ddd5c09026c9128800c1d772df4cc839.pdf"
            target="_blank"
            rel="noreferrer noopener"
            >Базовый стандарт совершения МФО операций на финансовом рынке</a
          >
        </p>
        <p>
          <a
            :class="$style.link"
            href="https://www.otlnal.ru/upload/iblock/279/2796713c8e96c35cef358f54be63a531.pdf"
            target="_blank"
            rel="noreferrer noopener"
            >Базовый стандарт по управлению рисками МФО&nbsp;</a
          >
        </p>
      </div>
      <div :class="$style.info_three">
        <h3 :class="$style.header">Персональные данные</h3>
        <p>
          <a
            :class="$style.link"
            href="https://www.otlnal.ru/upload/iblock/9c8/9c8b5e1f73df7cdb98d33a42ddb2ee1b.pdf"
            target="_blank"
            rel="noreferrer noopener"
            >Политика о порядке обработки персданных ООО МКК ФС</a
          >
        </p>

        <p>
          <a
            :class="$style.link"
            href="https://www.otlnal.ru/upload/iblock/111/1116f8909acc7a7e57ba02ac576d0da9.pdf"
            target="_blank"
            rel="noreferrer noopener"
            >Положение о защите перснальных данных ООО МКК ФС</a
          >
        </p>

        <p>
          <a
            :class="$style.link"
            href="https://www.otlnal.ru/upload/iblock/289/qfcajhrdss3ukp56vzb7vamlnbi6sgak.pdf"
            target="_blank"
            rel="noreferrer noopener"
            >Рекомендации клиентам по соблюдению информационной безопасности</a
          >
        </p>
      </div>
    </div>
    <div :class="$style.long_info">
      <h3 :class="$style.header">Документы на оформление потребзайма, информация для потребителя</h3>

      <p>
        <a
          :class="$style.link"
          href="https://www.otlnal.ru/upload/iblock/37c/37c08e2dc118182f53b51f5b45a1f17a.pdf"
          target="_blank"
          rel="noreferrer noopener"
          >Общие условия предоставления займов ООО МКК ФС</a
        >
      </p>
      <p>
        <a
          :class="$style.link"
          href="https://www.otlnal.ru/upload/iblock/4db/4db860bee5c74d88b288148f97b6440e.pdf"
          target="_blank"
          rel="noreferrer noopener"
          >Порядок разъяснения условий договора займа и иных документов</a
        >
      </p>
      <p>
        <a
          :class="$style.link"
          href="https://www.otlnal.ru/upload/iblock/610/610851b4fcd1ca9cb60029d02896972a.pdf"
          target="_blank"
          rel="noreferrer noopener"
          >Правила предоставления займов ООО МКК ФС</a
        >
      </p>
      <p>
        <a
          :class="$style.link"
          href="https://www.otlnal.ru/upload/iblock/4a7/4a7d092c560f3d8f4c4fa4c108e0b7ba.pdf"
          target="_blank"
          rel="noreferrer noopener"
          >Брошюра ЦБ РФ Микрофинансовая организация</a
        >
      </p>
      <p>
        <a
          :class="$style.link"
          href="https://www.otlnal.ru/upload/iblock/b11/b11166f56b8a9296c312514048a02da4.pdf"
          target="_blank"
          rel="noreferrer noopener"
          >Согласия и обязательства заемщика</a
        >
      </p>
      <p>
        <a
          :class="$style.link"
          href="https://www.otlnal.ru/upload/iblock/25d/25d42d1312adf513a610d4f28292a75e.pdf"
          target="_blank"
          rel="noreferrer noopener"
          >Информация об условиях предоставления, использования договора займа от 03.09.2018</a
        >
      </p>
      <p>
        <a
          :class="$style.link"
          href="https://www.otlnal.ru/upload/iblock/950/95024f6614a9915846db9c0bc5f8f2a6.pdf"
          target="_blank"
          rel="noreferrer noopener"
          >Общие условия договора потребительского займа от 30.07.2019</a
        >
      </p>
      <p>
        <a
          :class="$style.link"
          href="https://www.otlnal.ru/upload/iblock/c19/c19c263c89605a0e4125defdaa1c131c.pdf"
          target="_blank"
          rel="noreferrer noopener"
          >Общие условия договора займа от 03.09.2018</a
        >
      </p>
      <p>
        <a
          :class="$style.link"
          href="https://www.otlnal.ru/upload/iblock/a46/a465991059588087ce64cd29999c268a.pdf"
          target="_blank"
          rel="noreferrer noopener"
          >Общие условия договора потребительского займа от 04.08.2021&nbsp;</a
        >
      </p>
      <p>
        <a
          :class="$style.link"
          href="https://www.otlnal.ru/upload/iblock/376/3761f698c73162baef580b1b0b4b8dbc.pdf"
          target="_blank"
          rel="noreferrer noopener"
          >Правила предоставления потребительских займов от 30.07.2019</a
        >
      </p>
      <p>
        <a
          :class="$style.link"
          href="https://www.otlnal.ru/upload/iblock/c9d/c9dd651daf69673964be17eb44e41b79.pdf"
          target="_blank"
          rel="noreferrer noopener"
          >Правила предоставления займов от 03.09.2018</a
        >
      </p>
      <p>
        <a
          :class="$style.link"
          href="https://www.otlnal.ru/upload/iblock/d5a/d5a4f263f99c0d81fc66af2706a36826.pdf"
          target="_blank"
          rel="noreferrer noopener"
          >Соглашение АСП (займ)</a
        >
      </p>
      <p>
        <a
          :class="$style.link"
          href="https://www.otlnal.ru/upload/iblock/746/74685d538201e0d734398622248e0a88.pdf"
          target="_blank"
          rel="noreferrer noopener"
          >Приказ № 24-21-ФС от 04.08.2021</a
        >
      </p>
      <p>
        <a
          :class="$style.link"
          href="https://www.otlnal.ru/upload/iblock/bd2/bd2d67c84dedb1ea01976e0400f43200.pdf"
          target="_blank"
          rel="noreferrer noopener"
          >Информация об условиях предоставления, использования и возврата потребительского займа (редакция, действующая
          с 14.06.2021)</a
        >
      </p>
      <p>
        <a
          :class="$style.link"
          href="https://www.otlnal.ru/upload/iblock/68f/68ff24ca718cc87cb36acbb17360e6c5.pdf"
          target="_blank"
          rel="noreferrer noopener"
          >Информация об условиях предоставления, использования и возврата потребительского займа (редакция, действующая
          с 01.08.2019)</a
        >
      </p>
      <p>
        <a
          :class="$style.link"
          href="https://www.otlnal.ru/upload/iblock/bfb/bfb20b24efb56d2089a5edc0fcac3d44.pdf"
          target="_blank"
          rel="noreferrer noopener"
          >Информация об условиях предоставления, использования и возврата потребительского займа (редакция, действующая
          с 04.08.2021)</a
        >
      </p>
      <p>
        <a
          :class="$style.link"
          href="https://www.otlnal.ru/upload/iblock/e65/zw01i2inz3j2igethfmqnbsc14hh4518.pdf"
          target="_blank"
          rel="noreferrer noopener"
          >Приказ № 31-21-ФС Финансовый супермаркет о продлении акции Легкий ноль за 2022</a
        >
      </p>
      <p>
        <a
          :class="$style.link"
          href="https://www.otlnal.ru/upload/iblock/363/smtzpvzxsa6a1bqf0uekfm7chb3sp6h1.pdf"
          target="_blank"
          rel="noreferrer noopener"
          >Финансовый супермаркет Правила акции Легкий ноль на 2022 год</a
        >
      </p>
    </div>
  </div>
</template>

<style lang="scss" module>
.root {
  background-color: #f6f6f6;
}

.link {
  font-size: 1.2rem;
  opacity: 0.7;
}
.logo {
  display: flex;
  justify-content: center;
  align-items: center;
  padding: 3.6rem 0;
}
.info {
  background-color: #41c24c;
  display: grid;
  grid-template-columns: 1fr;
  color: #ffffff;
  padding: 2rem 2rem 0 2rem;
  @media (min-width: 40rem) {
    padding: 4rem 4rem 0 4rem;
    grid-template-columns: 1fr;
    row-gap: 1rem;
  }
  @media (min-width: 60rem) {
    padding: 6rem 6rem 0 6rem;
    grid-template-columns: 1fr 1fr 1fr;
    column-gap: 6rem;
  }
  @media (min-width: 75rem) {
    padding: 6rem 6rem 0 6rem;
    grid-template-columns: 1fr 1fr 1fr;
    column-gap: 6rem;
  }
}
.long_info {
  background-color: #41c24c;
  color: #ffffff;
  padding: 6rem;
  padding: 1rem 2rem 2rem 2rem;
  @media (min-width: 40rem) {
    padding: 1rem 4rem 4rem 4rem;
  }
}
.header {
  font-size: 2rem;
  margin: 0;
}
.links {
  display: grid;
  grid-template-columns: auto auto auto auto;
  column-gap: 0.6rem;
  justify-items: left;
  align-items: center;
  padding: 2rem 0;
}
</style>
